app/Controllers/Anime.php

    public function getAnime($id){

        $total = $this->animeModel->findAll();
        $animes['content'] = $this->animeModel->where('Rank', $id)->findAll();
---
SELECT *
FROM `anime`
SELECT *
FROM `anime`
WHERE `Rank` = '2'

    public function getAllAnimes(){
        $animes = $this->animeModel->findAll();
---
SELECT *
FROM `anime`
 LIMIT 1, 1

    public function getAllStudios(){

        $animes = $this->animeModel->findAll();
---
SELECT *
FROM `anime`

    private function insertStudios(){
        $animes = $this->animeModel->findAll();
---
SELECT *
FROM `anime`