app/Controllers/Anime.php

SELECT *
FROM `anime`
---
    public function getAllAnimes(){
        $animes = $this->animeModel->findAll();